{
  "personal": {
    "name": "Ujjwal Jha",
    "role": "Front-end Developer, Web Designer",
    "description": "I build exceptional and accessible digital experiences for the web.",
    "avatar": "/avatar.jpg",
    "location": "Bengaluru, India",
    "email": "searchingforujjwal@gmail.com",
    "socials": [
      {
        "platform": "GitHub",
        "url": "https://github.com/i-ujjwaljha"
      },
      {
        "platform": "LinkedIn",
        "url": "https://www.linkedin.com/in/i-ujjwaljha/"
      }
    ]
  },
  "about": {
    "title": "About Me",
    "description": "With a passion for both technology and design, I develop scalable, high-performance applications that captivate users and drive success.",
    "resume": "/Ujjwal_Resume.pdf"
  },
  "projects": [
    {
      "title": "Velvet Pour - GSAP Animation",
      "description": " I built and deployed a stunning cocktail website using React and Tailwind CSS, focusing on a scroll-driven experience powered by GSAP.",
      "tags": ["React", "GSAP", "TailwindCSS"],
      "image": "/velvetpour.png",
      "url": "https://velvetpour-gsap-landing.vercel.app/",
      "github": "https://github.com/i-ujjwaljha/velvetpour-gsap-landing"
    },
    {
      "title": "Brainwave - UI/UX Landing Page",
      "description": "This is a modern UI/UX website, developed using React.js and Tailwind CSS, that exemplifies modern UI/UX principles. Its sleek design, seamless animations, and overall user experience set a high standard, serving as a reference or inspiration for future modern applications or websites in general.",
      "tags": ["React", "TailwindCSS"],
      "image": "/brainwave.png",
      "url": "https://brainwave-page-web.vercel.app/",
      "github": "https://github.com/i-ujjwaljha/Brainwave"
    },
    {
      "title": "Hoobank UI/UX Landing Page",
      "description": "A modern UI/UX website for an arbitrary bank named Hoobank. It is developed using React.js and Tailwind CSS, setting a high standard for digital banking. Its sleek design, seamless animations, and overall user experience exemplify modern principles, serving as a reference for future applications.",
      "tags": ["React", "TailwindCSS"],
      "image": "/hoobank.png",
      "url": "https://modern-ebank-site.netlify.app/",
      "github": "https://github.com/i-ujjwaljha/modernlandingpage"
    }

  ],
  "blogs": [
    {
      "title": "Why AI Checkers Still Detect AI Content After Humanization?",
      "description": "So, you wrote something with AI, tried to humanize it somewhat, and those AI checkers still catch it? Similar to hiding a robot in a crowd – even if you put it in disguise, there are things that don’t work well at all.",
      "tags": ["React", "TailwindCSS"],
      "image": "/blog1.png",
      "url": "https://ujjwaljha.hashnode.dev/why-ai-checkers-still-detect-ai-content-after-humanization"
    },
    {
      "title": "The TypeScript Tease: Is It Worth the Hype?",
      "description": "While diving into React JS projects, I couldn't help but notice countless tutorials recommending TypeScript. This got me thinking: If JavaScript and other languages are already in the mix, why introduce yet another language? Turns out, there's a compelling reason. Let's explore the differences between JavaScript and TypeScript and understand why TypeScript has gained significant traction in the development community.",
      "tags": ["React", "TailwindCSS"],
      "image": "/TSvsJS.png",
      "url": "https://ujjwaljha.hashnode.dev/javascript-vs-typescript"
    }
  ],
  "skills": [
    { "name": "MS Dynamics" },
    { "name": "Blue Prism" },
    { "name": "RPA" },
    { "name": "Next JS" },
    { "name": "React JS" },
    { "name": "Node.js" },
    { "name": "JavaScript" },
    { "name": "HTML" },
    { "name": "CSS" },
    { "name": "Git" },
    { "name": "Figma" },
    { "name": "Adobe Phtoshop" }
  ],
  "experience": [
    {
      "company": "Allstate India",
      "role": "Apprentice Associate III",
      "startDate": "September 2024",
      "endDate": "Present",
      "responsibilities": [
        "Collaborated with the Underwriting team to analyze and document business requirements, translating them into efficient and scalable automated workflows within Blue Prism, and implemented monitoring procedures to track bot performance.",
        "Configured and maintained automated processes within Microsoft Dynamics, ensuring seamless integration with Blue Prism workflows for end-to-end automation, and utilized Blue Prism Control Room for bot monitoring and scheduling.",
        "Proactively monitored Blue Prism bots, identifying and resolving exceptions and errors to maintain process stability and minimize downtime."
      ]
    },
    {
      "company": "Oasis Infobyte",
      "role": "Web Development Intern",
      "startDate": "October 2023",
      "endDate": "November 2023",
      "responsibilities": [
        "Developed websites for small business owners. Utilized HTML, CSS, and JavaScript to create responsive and user-friendly interfaces",
        "Collaborated with the backend team to integrate APIs into the frontend using React.",
        "Gained experience in version control with Git, React JS, web accessibility best practices."
      ]
    }
  ]
}
